# Project Sales Analysis

<div style="background-color: #dbe4e1; padding: 20px">
    <b>Purpose of this project:</b>

With customer-centric marketing playing an important role in a business, we have been tasked to help a particular giftware online store to analyse their online sales data and also provide appropriate methods for customer segmentation. 

Hence, the store's sales data will be analysed to provide insights into the customer base. On the basis of Recency, Frequency, and Monetary values, the customers of the giftware online store will also be segmented into various meaningful groups using the k-means clustering algorithm, allowing the store owner to better understand the store's target audience and hence be able to market to the customers more effectively in the future. 

Source of dataset: <a href="https://archive.ics.uci.edu/ml/datasets/Online+Retail+II">UCI Machine Learning Repository</a>
</div>

In [1]:
#import libraries
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

### Reading Excel Files

In [2]:
#Reading Excel sheets into two separate DataFrames
xlsx = pd.ExcelFile('./datasets/data.xlsx')
df1 = pd.read_excel(xlsx, 'Year 2009-2010')
df2 = pd.read_excel(xlsx, 'Year 2010-2011')

In [3]:
#Concatenate both DataFrames into a single DataFrame and reset the index
retail = pd.concat([df1, df2], axis = 0, ignore_index=True)

In [4]:
retail.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom

In [5]:
retail.tail()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
1067366,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
1067367,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
1067368,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
1067369,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France
1067370,581587,POST,POSTAGE,1,2011-12-09 12:50:00,18.00,12680.0,France

In [ ]:
#export combined dataframes
#retail.to_csv('./datasets/raw_data.csv', index=False)

In [2]:
retail = pd.read_csv('./datasets/raw_data.csv')

In [3]:
retail.shape

(1067371, 8)

### Summary Statistics

In [4]:
#Summary statistics of data
#Minimum quantity and price are both not 0 (they are negative values)
round(retail.describe(),3)

          Quantity        Price  Customer ID
count  1067371.000  1067371.000   824364.000
mean         9.939        4.649    15324.639
std        172.706      123.553     1697.464
min     -80995.000   -53594.360    12346.000
25%          1.000        1.250    13975.000
50%          3.000        2.100    15255.000
75%         10.000        4.150    16797.000
max      80995.000    38970.000    18287.000

### Rows with Negative Quantity

In [5]:
#Filter rows based on "Quantity" that's less than 0
quantity_zero = retail[retail['Quantity'] < 0]
quantity_zero.shape

(22950, 8)

In [6]:
#Filter rows based on "Price" that's less than or equal to 0
price_zero = retail[retail['Price'] <= 0]
price_zero.shape

(6207, 8)

### Remove Negative quantities of Quantity and Price

In [7]:
#combined all rows to be dropped
to_drop = pd.concat([quantity_zero, price_zero], axis=0)
to_drop.shape

(29157, 8)

In [8]:
#Remove columns that contain negative Price and Quantity
retail.drop(index=to_drop.index, inplace=True)

In [9]:
retail.shape

(1041671, 8)

In [10]:
retail.columns = retail.columns.str.lower()
retail.head()

,invoice,stockcode,description,quantity,invoicedate,price,customer id,country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom

In [11]:
#replace any whitespaces in columns
retail.columns = retail.columns.str.replace(' ', '_')

In [12]:
retail.columns

Index(['invoice', 'stockcode', 'description', 'quantity', 'invoicedate',
       'price', 'customer_id', 'country'],
      dtype='object')

### Null values

In [13]:
retail.isnull().sum()

invoice             0
stockcode           0
description         0
quantity            0
invoicedate         0
price               0
customer_id    236122
country             0
dtype: int64

In [16]:
#missing customer_ids are present for many invoices
missing_customer = retail[retail['customer_id'].isna()]
missing_customer.head()

,invoice,stockcode,description,quantity,invoicedate,price,customer_id,country
577,489525,85226C,BLUE PULL BACK RACING CAR,1,2009-12-01 11:49:00,0.55,NaN,United Kingdom
578,489525,85227,SET/6 3D KIT CARDS FOR KIDS,1,2009-12-01 11:49:00,0.85,NaN,United Kingdom
1055,489548,22271,FELTCRAFT DOLL ROSIE,1,2009-12-01 12:32:00,2.95,NaN,United Kingdom
1056,489548,22254,FELT TOADSTOOL LARGE,12,2009-12-01 12:32:00,1.25,NaN,United Kingdom
1057,489548,22273,FELTCRAFT DOLL MOLLY,3,2009-12-01 12:32:00,2.95,NaN,United Kingdom

In [20]:
#one customer_id can have multiple invoice numbers
#hence, these invoices with null customer_id could possibly be from an existing customer_id (repeat purchase)
retail[retail['customer_id']==14911]['invoice'].head(100).unique()

array(['489520', '490542', '490687', '490972'], dtype=object)

We will drop these customer_ids with null values instead later after doing EDA on the other columns without null values, since these values are still useful for EDA.

#to find the max customer_id number at the moment
retail['customer_id'].describe()

#set the first value first
missing_customer['customer_id'].iloc[0] = 18288

start_num = 18288 #max customer_id + 1
invoice_no = missing_customer['invoice']

#to fill in missing customer_ids (after 18287)
for i in range(1,len(missing_customer)):
    #same invoice number should have same customer_id
    if invoice_no.iloc[i] == invoice_no.iloc[i-1]:
        missing_customer['customer_id'].iloc[i] = start_num
    
    else: 
        #increase customer_id by 1 if invoice number is different
        start_num = start_num + 1
        missing_customer['customer_id'].iloc[i] = start_num

missing_customer.to_csv('./datasets/missing_customer_id.csv')

#fill in customer_ids in retail dataframe from missing_customer dataframe
for x in missing_customer.index:
    retail['customer_id'].loc[x] = missing_customer['customer_id'].loc[x]

retail.to_csv('./datasets/cleaned_data_no_null.csv', index=False)

### Column types

In [21]:
#invoicedate should be in datatime format
retail.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1041671 entries, 0 to 1067370
Data columns (total 8 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   invoice      1041671 non-null  object
 1   stockcode    1041671 non-null  object
 2   description  1041671 non-null  object
 3   quantity     1041671 non-null  int64
 4   invoicedate  1041671 non-null  object
 5   price        1041671 non-null  float64
 6   customer_id  805549 non-null   float64
 7   country      1041671 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 71.5+ MB

In [23]:
#changing the dtype of invoicedate
retail = retail.astype({"invoicedate": 'datetime64[ns]'})

In [25]:
retail.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1041671 entries, 0 to 1067370
Data columns (total 8 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   invoice      1041671 non-null  object
 1   stockcode    1041671 non-null  object
 2   description  1041671 non-null  object
 3   quantity     1041671 non-null  int64
 4   invoicedate  1041671 non-null  datetime64[ns]
 5   price        1041671 non-null  float64
 6   customer_id  805549 non-null   float64
 7   country      1041671 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 71.5+ MB

### Set InvoiceDate as Index

In [26]:
#Set invoicedate as index
retail = retail.set_index('invoicedate')

### Exporting CSV

In [27]:
#Export the DataFrame as CSV
retail.to_csv('./datasets/cleaned_data.csv')